WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/RpcLit/SoapWsdl.BaseDataTypes.XmlFormatter.RpcLit_RetDateTime_Client_Request-18.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesRpcLit/RetDateTime</a:Action>
    <a:MessageID>urn:uuid:1a44321b-2a29-46ad-8682-e46ca4a4ee48</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetDateTime xmlns="http://tempuri.org/">
      <inDateTime xmlns="">2001-05-30T06:40:10-07:00</inDateTime>
    </RetDateTime>
  </s:Body>
</s:Envelope>